fix: update Readme Architecture Overview
